# PANDAS

•	Pandas is an open-source Python Library providing high-performance data manipulation and analysis tool using its powerful data structures.

•	In 2008, developer Wes McKinney started developing pandas when in need of high performance, flexible tool for analysis of data.

•	Initial release	11 January 2008

•	Using Pandas, we can accomplish five typical steps in the processing and analysis of data, regardless of the origin of data — load, prepare, manipulate, model, and analyze.

## Key Features of Pandas
•	Fast and efficient DataFrame object with default and customized indexing.

•	Tools for loading data into in-memory data objects from different file formats.(CSV,XLSX,JSON,XML,HTML,pytabes,SQL,SAS)

•	Data alignment and integrated handling of missing data.

•	Reshaping and pivoting of date sets.

•	Label-based slicing, indexing and subsetting of large data sets.

•	Columns from a data structure can be deleted or inserted.

•	Group by data for aggregation and transformations.

•	High performance merging and joining of data.

•	Time Series functionality.

## Installation Instructions
    conda install pandas
    pip install pandas

## Using Pandas

Once you've installed Pandas you can import it as a library:

In [ ]:
import pandas as pd

In [ ]:
import numpy as np

# Series

A Series is very similar to a NumPy array (in fact it is built on top of the NumPy array object). What differentiates the NumPy array from a Series, is that a Series can have axis labels, meaning it can be indexed by a label, instead of just a number location. It also doesn't need to hold numeric data, it can hold any arbitrary Python Object.

### Creating a Series

converting a list,  numpy array or dictionary to a Series:

In [ ]:
labels = ['ag','bh','cd']
my_list = [2,3,4]
arr = np.array(my_list)
d = {'l':10,'g':20,'d':30}

**Using Lists**

In [ ]:
pd.Series(data = my_list)

0    2
1    3
2    4
dtype: int64

In [ ]:
pd.Series(data = my_list , index = labels)  # recommended

ag    2
bh    3
cd    4
dtype: int64

In [ ]:
pd.Series(my_list,labels)

ag    2
bh    3
cd    4
dtype: int64

**NumPy Arrays**

In [ ]:
pd.Series(arr)

0    2
1    3
2    4
dtype: int32

In [ ]:
pd.Series(arr,labels)

ag    2
bh    3
cd    4
dtype: int32

**Dictionary**

In [ ]:
pd.Series(d)

l    10
g    20
d    30
dtype: int64

### Data in a Series

A pandas Series can hold a variety of object types:

In [ ]:
pd.Series(data = labels)

0    ag
1    bh
2    cd
dtype: object

## Using an Index

The key to using a Series is understanding its index. Pandas makes use of these index names or numbers by allowing for fast look ups of information (works like a hash table or dictionary).

In [ ]:
ser1 = pd.Series(data = [1,2,3,4] , index = ['a', 'b','c', 'd'])

In [ ]:
ser1

a    1
b    2
c    3
d    4
dtype: int64

In [ ]:
ser2 = pd.Series([10,20,50,40] , index = ['a', 'b','cde', 'd'])

In [ ]:
ser2

a      10
b      20
cde    50
d      40
dtype: int64

In [ ]:
# retriveing data using label index
ser1['a']

1

In [ ]:
# can also work with numerical index like list , string, tuple
ser1[0]

1

In [ ]:
#retrieve the first three element
ser1[:3]

a    1
b    2
c    3
dtype: int64

### head(n)
Returns the first n rows.

In [ ]:
ser1.head(2)

a    1
b    2
c    3
d    4
dtype: int64

### tail(n)

Returns the last n rows.

In [ ]:
ser1.tail(2)

c    3
d    4
dtype: int64

### values
Returns the actual data in the series as an array.

In [ ]:
ser1.values

array([1, 2, 3, 4], dtype=int64)

#### Operations are also done using index:

In [ ]:
ser1 + ser2

a      11.0
b      22.0
c       NaN
cde     NaN
d      44.0
dtype: float64

# DataFrames

•	DataFrames are directly inspired by the R programming language.
We can think of a DataFrame as a bunch of Series objects put together to share the same index.

•  It is two-dimensional(2-D) data structure which consists of rows and columns.

#### Features of DataFrame
•	Potentially columns are of different types

•	Size – Mutable

•	Labeled axes (rows and columns)

•	Can Perform Arithmetic operations on rows and columns

#### Syntax
       pd.DataFrame(data, index, columns, dtype)
       
       here ,data can be dictionaries , Series , 2D-numpy Ndarray , lists

**Program to Create Data Frame with dictionaries**

In [ ]:
dict1 = {'a':[1,2,3] , 'b':[4,5,6] ,  'c':[7,8,9] ,  'd': [10 , 11 , 12] } 

df = pd.DataFrame(dict1) 
df

   a  b  c   d
0  1  4  7  10
1  2  5  8  11
2  3  6  9  12

In [ ]:
dict1 = {'a':1, 'b':2, 'c':3, 'd':4}         
dict2 = {'a':5, 'b':6, 'c':7, 'd':8, 'e':9}

Data = {'first':dict1, 'second':dict2}  # Define Data with dict1 and dict2 

df = pd.DataFrame(Data)

In [ ]:
df

   first  second
a    1.0       5
b    2.0       6
c    3.0       7
d    4.0       8
e    NaN       9

**Program to Create Data Frame with series**

In [ ]:
s1 = pd.Series([1, 3, 4, 5, 6, 2, 9])         
s2 = pd.Series(['a', 'b', 'c', 'd', 'e'])  

Data ={'first':s1, 'second':s2} 
dfseries = pd.DataFrame(Data)     
dfseries

   first second
0      1      a
1      3      b
2      4      c
3      5      d
4      6      e
5      2    NaN
6      9    NaN

**Program to Create Data Frame with lists**

In [ ]:
#  for list both the list should have same length
l1 =[1, 3, 4, 5, 6, 2, 9]
l2 =['a', 'b', 'c', 'd', 'e','f','k']
Data ={'first':l1, 'second':l2} 
dfl = pd.DataFrame(Data)     
dfl

   first second
0      1      a
1      3      b
2      4      c
3      5      d
4      6      e
5      2      f
6      9      k

In [ ]:
dfl.dtypes

first      int64
second    object
dtype: object

In [ ]:
from numpy import arange

In [ ]:
df = pd.DataFrame( arange(20).reshape(5,4)  ,  index = [11,52,'abc',46,75]  ,   columns = 'A B C D'.split() )

In [ ]:
df

      A   B   C   D
11    0   1   2   3
52    4   5   6   7
abc   8   9  10  11
46   12  13  14  15
75   16  17  18  19

**Getting dimension**

In [ ]:
df.ndim

2

### head(n)
Returns the first n rows.

In [ ]:
df.head(2)

    A  B  C  D
11  0  1  2  3
52  4  5  6  7

### tail(n)

Returns the last n rows.

In [ ]:
df.tail(2)

     A   B   C   D
46  12  13  14  15
75  16  17  18  19

### values
Returns the actual data in the series as an array.

In [ ]:
df.values

array([[ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11],
       [12, 13, 14, 15],
       [16, 17, 18, 19]])

## Selection and Indexing

In [ ]:
df

      A   B   C   D
11    0   1   2   3
52    4   5   6   7
abc   8   9  10  11
46   12  13  14  15
75   16  17  18  19

In [ ]:
df['A']

11      0
52      4
abc     8
46     12
75     16
Name: A, dtype: int32

In [ ]:
# Pass a list of column names
df[['A','B','C']]

      A   B   C
11    0   1   2
52    4   5   6
abc   8   9  10
46   12  13  14
75   16  17  18

In [ ]:
# SQL Syntax (NOT RECOMMENDED!)
df.A

11      0
52      4
abc     8
46     12
75     16
Name: A, dtype: int32

**DataFrame Columns are just Series**

In [ ]:
type(df['A'])

pandas.core.series.Series

**Creating a new column:**

In [ ]:
df['new'] = df['A'] + df['B']

In [ ]:
df

      A   B   C   D  new
11    0   1   2   3    1
52    4   5   6   7    9
abc   8   9  10  11   17
46   12  13  14  15   25
75   16  17  18  19   33

**Removing Columns**

In [ ]:
df.drop('new' , axis = 1 )

      A   B   C   D
11    0   1   2   3
52    4   5   6   7
abc   8   9  10  11
46   12  13  14  15
75   16  17  18  19

In [ ]:
# df still has new column because we did not specigy inplace parameter
df

      A   B   C   D  new
11    0   1   2   3    1
52    4   5   6   7    9
abc   8   9  10  11   17
46   12  13  14  15   25
75   16  17  18  19   33

In [ ]:
df.drop('new', axis = 1 , inplace = True )
df

      A   B   C   D
11    0   1   2   3
52    4   5   6   7
abc   8   9  10  11
46   12  13  14  15
75   16  17  18  19

In [ ]:
df

      A   B   C   D
11    0   1   2   3
52    4   5   6   7
abc   8   9  10  11
46   12  13  14  15
75   16  17  18  19

**Permanently Removing a Column**

In [ ]:
del df['A']

In [ ]:
df

      B   C   D
11    1   2   3
52    5   6   7
abc   9  10  11
46   13  14  15
75   17  18  19

**Droping Rows**

In [ ]:
df.drop(52 , axis=0)

      B   C   D
11    1   2   3
abc   9  10  11
46   13  14  15
75   17  18  19

In [ ]:
df

      B   C   D
11    1   2   3
52    5   6   7
abc   9  10  11
46   13  14  15
75   17  18  19

In [ ]:
df.drop(52 , axis = 0 , inplace = True)

In [ ]:
df

      B   C   D
11    1   2   3
abc   9  10  11
46   13  14  15
75   17  18  19

**Selecting Rows**

In [ ]:
df.loc['abc']

B     9
C    10
D    11
Name: abc, dtype: int32

**selection based on position instead of label**

In [ ]:
df.iloc[1]

B     9
C    10
D    11
Name: abc, dtype: int32

**Selecting subset of rows and columns**

In [ ]:
df.loc[46,'D']

15

In [ ]:
df

      B   C   D
11    1   2   3
abc   9  10  11
46   13  14  15
75   17  18  19

In [ ]:
df.loc[ ['abc',11],['A','D']]

     A   D
abc  8  11
11   0   3

In [ ]:
df.iloc[[0,1],[1,2]]

      C   D
11    2   3
abc  10  11

### Statistics on data

In [ ]:
df

      B   C   D
11    1   2   3
abc   9  10  11
46   13  14  15
75   17  18  19

In [ ]:
df.sum()

B    40
C    44
D    48
dtype: int64

In [ ]:
df.mean()

B    10.0
C    11.0
D    12.0
dtype: float64

In [ ]:
df.std()

B    6.831301
C    6.831301
D    6.831301
dtype: float64

In [ ]:
df.median()

B    11.0
C    12.0
D    13.0
dtype: float64

In [ ]:
df.prod()
# Product of Values

B    1989
C    5040
D    9405
dtype: int32

In [ ]:
print(df)
df.cumsum()
# Cumulative Sum   ef for col A = 0 , 0+4 = 0 , 4+8 = 12 , 12+12 = 24 , 24+16 = 40

      B   C   D
11    1   2   3
abc   9  10  11
46   13  14  15
75   17  18  19

      B   C   D
11    1   2   3
abc  10  12  14
46   23  26  29
75   40  44  48

In [ ]:
print(df)
df.cumprod()
# Cumulative Product

      B   C   D
11    1   2   3
abc   9  10  11
46   13  14  15
75   17  18  19

        B     C     D
11      1     2     3
abc     9    20    33
46    117   280   495
75   1989  5040  9405

In [ ]:
df

      B   C   D
11    1   2   3
abc   9  10  11
46   13  14  15
75   17  18  19

### Conditional Selection

An important feature of pandas is conditional selection using bracket notation, very similar to numpy:

In [ ]:
df

      B   C   D
11    1   2   3
abc   9  10  11
46   13  14  15
75   17  18  19

In [ ]:
df>10

         B      C      D
11   False  False  False
abc  False  False   True
46    True   True   True
75    True   True   True

In [ ]:
df[df>10]

        A     B     C     D
11    NaN   NaN   NaN   NaN
52    NaN   NaN   NaN   NaN
abc   NaN   NaN   NaN  11.0
46   12.0  13.0  14.0  15.0
75   16.0  17.0  18.0  19.0

In [ ]:
df

      B   C   D
11    1   2   3
abc   9  10  11
46   13  14  15
75   17  18  19

In [ ]:
df[df['B'] > 10]
#returns rows whose ALL the elements satisfy the condition.does not return row if it has even one False w.r.t to condition.

     B   C   D
46  13  14  15
75  17  18  19

In [ ]:
df[df['B']>10]['C']
#  returns view object showing column D values where values of A > 10

46    14
75    18
Name: C, dtype: int32

In [ ]:
df[df['B']>10][['C','B']]

     C   B
46  14  13
75  18  17

**For two conditions you can use | and & with parenthesis:**

In [ ]:
df [    ( df['B'] > 10 )   &        ( df['C'] > 15 )    ]  # & = and

     B   C   D
75  17  18  19

In [ ]:
df [    ( df['B'] > 10 )    |        ( df['C'] > 15 )    ]  # & = and

     B   C   D
46  13  14  15
75  17  18  19

**Sorting and Ordering a DataFrame:**

In [ ]:
df

      B   C   D
11    1   2   3
abc   9  10  11
46   13  14  15
75   17  18  19

In [ ]:
df.sort_values(by = 'B' , ascending = False) #inplace=False by default

      B   C   D
75   17  18  19
46   13  14  15
abc   9  10  11
11    1   2   3

# Missing Data

In [ ]:
df = pd.DataFrame({'A':[10,3,None],   'B':[9,None , None], 'C':[15,20,35]})

#  None  , np.nan =  gives a null value

In [ ]:
df

      A    B   C
0  10.0  9.0  15
1   3.0  NaN  20
2   NaN  NaN  35

In [ ]:
df.dropna()

      A    B   C
0  10.0  9.0  15

In [ ]:
df.dropna(axis=1)
# axis 1 means along column

    C
0  15
1  20
2  35

In [ ]:
df.fillna(value='ANYTHING',)

          A         B   C
0        10         9  15
1         3  ANYTHING  20
2  ANYTHING  ANYTHING  35

**Find Null Values or Check for Null Values**

In [ ]:
df.isnull()

       A      B      C
0  False  False  False
1  False   True  False
2   True   True  False

In [ ]:
data = {'A':['foo','foo','foo','bar','bar','bar'],
        'B':['one','one','two','two','one','one'],
        'C':['x','y','x','y','x','y'],
        'D':[1,3,2,None,4,1]}

df = pd.DataFrame(data)

In [ ]:
df

     A    B  C    D
0  foo  one  x  1.0
1  foo  one  y  3.0
2  foo  two  x  2.0
3  bar  two  y  NaN
4  bar  one  x  4.0
5  bar  one  y  1.0

In [ ]:
df['D'].fillna(value = df['D'].mean())

0    1.0
1    3.0
2    2.0
3    2.2
4    4.0
5    1.0
Name: D, dtype: float64

# Duplicated data

In [ ]:
data = pd.DataFrame({'k1': ['one'] * 3 + ['two'] * 4,'k2': [1, 1, 2, 3, 3, 4, 4]})
# data

In [ ]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   k1      7 non-null      object
 1   k2      7 non-null      int64
dtypes: int64(1), object(1)
memory usage: 240.0+ bytes

In [ ]:
data.describe()

             k2
count  7.000000
mean   2.571429
std    1.272418
min    1.000000
25%    1.500000
50%    3.000000
75%    3.500000
max    4.000000

In [ ]:
data

    k1  k2
0  one   1
1  one   1
2  one   2
3  two   3
4  two   3
5  two   4
6  two   4

In [ ]:
data.duplicated()

0    False
1     True
2    False
3    False
4     True
5    False
6     True
dtype: bool

In [ ]:
data['k1']

0    one
1    one
2    one
3    two
4    two
5    two
6    two
Name: k1, dtype: object

In [ ]:
data['k1'].duplicated()

0    False
1     True
2     True
3    False
4     True
5     True
6     True
Name: k1, dtype: bool

In [ ]:
data.drop_duplicates(inplace = True )
data

    k1  k2
0  one   1
2  one   2
3  two   3
5  two   4

# Groupby

The groupby method allows you to group rows of data together and call aggregate functions

In [ ]:
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Manpower':[220,430,30,1024,220,300] , 
       'Sales':[200,120,340,124,243,350]}

In [ ]:
df = pd.DataFrame(data)

In [ ]:
df

  Company   Person  Manpower  Sales
0    GOOG      Sam       220    200
1    GOOG  Charlie       430    120
2    MSFT      Amy        30    340
3    MSFT  Vanessa      1024    124
4      FB     Carl       220    243
5      FB    Sarah       300    350

**group based off of Company. This will create a DataFrameGroupBy object:**

In [ ]:
df.groupby('Company')

**we can save it to a new variabe**

In [ ]:
df.groupby('Company').mean()

         Manpower  Sales
Company
FB          260.0  296.5
GOOG        325.0  160.0
MSFT        527.0  232.0

In [ ]:
groupdf = df.groupby("Company")

In [ ]:
#  can be don by calling variable
groupdf.mean()

         Manpower  Sales
Company
FB          260.0  296.5
GOOG        325.0  160.0
MSFT        527.0  232.0

In [ ]:
groupdf.std()

           Manpower       Sales
Company
FB        56.568542   75.660426
GOOG     148.492424   56.568542
MSFT     702.864140  152.735065

In [ ]:
groupdf.min()

          Person  Manpower  Sales
Company
FB          Carl       220    243
GOOG     Charlie       220    120
MSFT         Amy        30    124

In [ ]:
groupdf.max()

          Person  Manpower  Sales
Company
FB         Sarah       300    350
GOOG         Sam       430    200
MSFT     Vanessa      1024    340

In [ ]:
groupdf.count()

         Person  Manpower  Sales
Company
FB            2         2      2
GOOG          2         2      2
MSFT          2         2      2

In [ ]:
groupdf.describe()

        Manpower                                                        Sales  \
           count   mean         std    min    25%    50%    75%     max count
Company
FB           2.0  260.0   56.568542  220.0  240.0  260.0  280.0   300.0   2.0
GOOG         2.0  325.0  148.492424  220.0  272.5  325.0  377.5   430.0   2.0
MSFT         2.0  527.0  702.864140   30.0  278.5  527.0  775.5  1024.0   2.0


          mean         std    min     25%    50%     75%    max
Company
FB       296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG     160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT     232.0  152.735065  124.0  178.00  232.0  286.00  340.0

In [ ]:
groupdf.describe().transpose()

Company                 FB        GOOG         MSFT
Manpower count    2.000000    2.000000     2.000000
         mean   260.000000  325.000000   527.000000
         std     56.568542  148.492424   702.864140
         min    220.000000  220.000000    30.000000
         25%    240.000000  272.500000   278.500000
         50%    260.000000  325.000000   527.000000
         75%    280.000000  377.500000   775.500000
         max    300.000000  430.000000  1024.000000
Sales    count    2.000000    2.000000     2.000000
         mean   296.500000  160.000000   232.000000
         std     75.660426   56.568542   152.735065
         min    243.000000  120.000000   124.000000
         25%    269.750000  140.000000   178.000000
         50%    296.500000  160.000000   232.000000
         75%    323.250000  180.000000   286.000000
         max    350.000000  200.000000   340.000000

In [ ]:
groupdf.describe().transpose()['GOOG']

Manpower  count      2.000000
          mean     325.000000
          std      148.492424
          min      220.000000
          25%      272.500000
          50%      325.000000
          75%      377.500000
          max      430.000000
Sales     count      2.000000
          mean     160.000000
          std       56.568542
          min      120.000000
          25%      140.000000
          50%      160.000000
          75%      180.000000
          max      200.000000
Name: GOOG, dtype: float64

# Merging and Concatenating

### Example DataFrames

In [ ]:
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3'],
                        'C': ['C0', 'C1', 'C2', 'C3'],
                        'D': ['D0', 'D1', 'D2', 'D3']},
                        index=[0, 1, 2, 3])

In [ ]:
df2 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],
                        'B': ['B4', 'B5', 'B6', 'B7'],
                        'C': ['C4', 'C5', 'C6', 'C7'],
                        'D': ['D4', 'D5', 'D6', 'D7']},
                         index=[4, 5, 6, 7])

In [ ]:
df3 = pd.DataFrame({'A': ['A8', 'A9', 'A10', 'A11'],
                        'B': ['B8', 'B9', 'B10', 'B11'],
                        'C': ['C8', 'C9', 'C10', 'C11'],
                        'D': ['D8', 'D9', 'D10', 'D11']},
                        index=[1,2,3,4])

In [ ]:
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [ ]:
df2

    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [ ]:
df3

     A    B    C    D
1   A8   B8   C8   D8
2   A9   B9   C9   D9
3  A10  B10  C10  D10
4  A11  B11  C11  D11

## Concatenation

Concatenation basically glues together DataFrames. Keep in mind that dimensions should match along the axis you are concatenating on. You can use **pd.concat** and pass in a list of DataFrames to concatenate together:

In [ ]:
pd.concat([df1,df2,df3] )

     A    B    C    D
0   A0   B0   C0   D0
1   A1   B1   C1   D1
2   A2   B2   C2   D2
3   A3   B3   C3   D3
4   A4   B4   C4   D4
5   A5   B5   C5   D5
6   A6   B6   C6   D6
7   A7   B7   C7   D7
1   A8   B8   C8   D8
2   A9   B9   C9   D9
3  A10  B10  C10  D10
4  A11  B11  C11  D11

In [ ]:
#  concatinating along columns
pd.concat([df1,df2,df3] , axis=1)

     A    B    C    D    A    B    C    D    A    B    C    D
0   A0   B0   C0   D0  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
1   A1   B1   C1   D1  NaN  NaN  NaN  NaN   A8   B8   C8   D8
2   A2   B2   C2   D2  NaN  NaN  NaN  NaN   A9   B9   C9   D9
3   A3   B3   C3   D3  NaN  NaN  NaN  NaN  A10  B10  C10  D10
4  NaN  NaN  NaN  NaN   A4   B4   C4   D4  A11  B11  C11  D11
5  NaN  NaN  NaN  NaN   A5   B5   C5   D5  NaN  NaN  NaN  NaN
6  NaN  NaN  NaN  NaN   A6   B6   C6   D6  NaN  NaN  NaN  NaN
7  NaN  NaN  NaN  NaN   A7   B7   C7   D7  NaN  NaN  NaN  NaN

## Example DataFrames

In [ ]:
left = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                     'A': ['A0', 'A1', 'A2', 'A3'],
                     'B': ['B0', 'B1', 'B2', 'B3']})
   
right = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                          'C': ['C0', 'C1', 'C2', 'C3'],
                          'D': ['D0', 'D1', 'D2', 'D3']})

In [ ]:
left

  key   A   B
0  K0  A0  B0
1  K1  A1  B1
2  K2  A2  B2
3  K3  A3  B3

In [ ]:
right

  key   C   D
0  K0  C0  D0
1  K1  C1  D1
2  K2  C2  D2
3  K3  C3  D3

## Merging

The **merge** function allows you to merge DataFrames together.

In [ ]:
pd.merge(left,right , how = 'inner', on='key')

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2
3  K3  A3  B3  C3  D3

**another example:**

In [ ]:
left = pd.DataFrame({'key1': ['K0', 'K0', 'K1', 'K2'],
                     'key2': ['K0', 'K1', 'K0', 'K1'],
                        'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3']})
    
right = pd.DataFrame({'key1': ['K0', 'K1', 'K1', 'K2'],
                               'key2': ['K0', 'K0', 'K0', 'K0'],
                                  'C': ['C0', 'C1', 'C2', 'C3'],
                                  'D': ['D0', 'D1', 'D2', 'D3']})

In [ ]:
left

  key1 key2   A   B
0   K0   K0  A0  B0
1   K0   K1  A1  B1
2   K1   K0  A2  B2
3   K2   K1  A3  B3

In [ ]:
right

  key1 key2   C   D
0   K0   K0  C0  D0
1   K1   K0  C1  D1
2   K1   K0  C2  D2
3   K2   K0  C3  D3

In [ ]:
pd.merge(left, right, on=['key1', 'key2'] ,how='inner')

  key1 key2   A   B   C   D
0   K0   K0  A0  B0  C0  D0
1   K1   K0  A2  B2  C1  D1
2   K1   K0  A2  B2  C2  D2

In [ ]:
pd.merge(left, right, how='outer', on=['key1', 'key2'])

  key1 key2    A    B    C    D
0   K0   K0   A0   B0   C0   D0
1   K0   K1   A1   B1  NaN  NaN
2   K1   K0   A2   B2   C1   D1
3   K1   K0   A2   B2   C2   D2
4   K2   K1   A3   B3  NaN  NaN
5   K2   K0  NaN  NaN   C3   D3

In [ ]:
pd.merge(left, right, how = 'right', on=['key1', 'key2'])

  key1 key2    A    B   C   D
0   K0   K0   A0   B0  C0  D0
1   K1   K0   A2   B2  C1  D1
2   K1   K0   A2   B2  C2  D2
3   K2   K0  NaN  NaN  C3  D3

In [ ]:
pd.merge(left, right, how='left', on=['key1', 'key2'])

  key1 key2   A   B    C    D
0   K0   K0  A0  B0   C0   D0
1   K0   K1  A1  B1  NaN  NaN
2   K1   K0  A2  B2   C1   D1
3   K1   K0  A2  B2   C2   D2
4   K2   K1  A3  B3  NaN  NaN

# Operations

There are lots of operations with pandas that will be really useful to you, but don't fall into any distinct category.

In [ ]:
df = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz']})
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [ ]:
df['col2'].unique()

array([444, 555, 666], dtype=int64)

In [ ]:
df['col2'].nunique()

3

In [ ]:
df['col2'].value_counts()

444    2
666    1
555    1
Name: col2, dtype: int64

### Selecting Data

In [ ]:
#Select from DataFrame using criteria from multiple columns
newdf = df[ (df['col1']>2)  &  (df['col2']==444)]

In [ ]:
newdf

   col1  col2 col3
3     4   444  xyz

### Applying Functions

In [ ]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [ ]:
df['col3'].apply(len)

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

In [ ]:
df['col1'].sum()

10

**Get column and index names:**

In [ ]:
df.columns

Index(['col1', 'col2', 'col3'], dtype='object')

In [ ]:
df.index

RangeIndex(start=0, stop=4, step=1)

### Pivot Table

In [ ]:
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Person':['Sam','Charlie','Sam','Vanessa','Carl','Sarah'],
       'Income':[220,430,30,1024,220,300]}

In [ ]:
df = pd.DataFrame(data)

In [ ]:
df

  Company   Person  Income
0    GOOG      Sam     220
1    GOOG  Charlie     430
2    MSFT      Sam      30
3    MSFT  Vanessa    1024
4      FB     Carl     220
5      FB    Sarah     300

In [ ]:
df.pivot_table(values='Income' , index=['Company'] , columns=['Person'])

Person    Carl  Charlie    Sam  Sarah  Vanessa
Company
FB       220.0      NaN    NaN  300.0      NaN
GOOG       NaN    430.0  220.0    NaN      NaN
MSFT       NaN      NaN   30.0    NaN   1024.0

# Data Input and Output

This notebook is the reference code for getting input and output, pandas can read a variety of file types using its pd.read_ methods.

## CSV

### CSV Input

In [ ]:
df = pd.reread_csv('example.csv')
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [ ]:
df

  Company   Person  Income
0    GOOG      Sam     220
1    GOOG  Charlie     430
2    MSFT      Sam      30
3    MSFT  Vanessa    1024
4      FB     Carl     220
5      FB    Sarah     300

In [ ]:
df.to_csv('xyz.csv')